app/services/friender.rb

  def friends_on_facebook
    User.where(facebook_user_id: facebook_client.facebook_friend_ids)
---
SELECT "users"."id" FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."facebook_user_id" IN ('10205566356342403', '1304768926215220', '1108183792548115')