app/helpers/request_helper.rb

SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT 1
---
 def merge_request(request,current_user_id,type)
    @request = {}
    @user = {}
    seller_messages = []
    gig = Gig.find(request.gig_id)

SELECT  "messages".* FROM "messages" WHERE "messages"."request_id" = $1  ORDER BY "messages"."id" DESC LIMIT 1
---
 def lattest_message(request_id,user_id,current_user_id)
     message = Message.where(:request_id => request_id).last

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT 1
---
 def find_user(id)
    User.find(id)