app/controllers/api/v1/apis_controller.rb

  def sign_in(token)
    @current_user = User.find_by(token: token)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."token" = $1 LIMIT 1