app/controllers/api/v1/gigs_controller.rb

    def find_gig
      Gig.find_by("id = ? AND status != ?",params[:id],'2')
---
SELECT  "gigs".* FROM "gigs" WHERE (id = '6' AND status != '2') LIMIT 1