app/controllers/api/v1/requests_controller.rb

		def requests
			@requests = []
			requests = Request.where(:seller_id => User.get_user(token).id).each do |request|
				@requests.push(merge_request(request,User.get_user(token).id,INCOMING))
			end
			requests = Request.where(:buyer_id => User.get_user(token).id).each do |request|
---
SELECT "requests".* FROM "requests" WHERE "requests"."seller_id" = $1
SELECT "requests".* FROM "requests" WHERE "requests"."buyer_id" = $1