app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."facebook_user_id" = $1  ORDER BY "users"."id" ASC LIMIT 1
---
          merge(token: Token.new.generate).
          merge(password: 'none')
      )
      @user_exists = User.where(:facebook_user_id => @user.facebook_user_id).first

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND (lower(email) = 'raghavp152@gmail.com')  ORDER BY "users"."id" ASC LIMIT 1
---
        render :show, status: 201
      else
        # User does not exists so create a new User
        user =  User.where('lower(email) = ?', @user[:email].downcase).first

UPDATE "users" SET "photo_url" = $1, "updated_at" = $2 WHERE "users"."id" = $3
INSERT INTO "users" ("facebook_user_token", "first_name", "last_name", "email", "facebook_user_id", "gender", "token", "encrypted_password", "is_seller", "logged_in", "created_at", "updated_at", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
          user[:is_facebook_verified] = User.is_facebook_verified(user.id)
          render :json => user
        else
          if @user.save