app/models/gig.rb

    def self.gig_data(gig_ids,token,featured,query)
    	if gig_ids.kind_of?(Array)
    		@gig_ids = gig_ids
    	else
    		@gig_ids = gig_ids.split(',')
    	end
    	cities = []
    	if featured != nil
    		@gigs = Gig.where(id: gig_ids,featured: featured).order('updated_at desc')
    	else
    		@gigs = Gig.where(id: gig_ids).order('updated_at desc')
    	end
    	if query != nil
    		@query = query.downcase
    	else
    		@query = query
    	end
		@gigs.where('lower(title) LIKE ?',"%#{@query}%").each do |gig|
---
SELECT "gigs".* FROM "gigs" WHERE "gigs"."featured" = $1 AND "gigs"."id" IN (3, 1, 6, 5, 2, 4) AND (lower(title) LIKE '%%')  ORDER BY updated_at desc

    def self.gig_details(gig,token)
    	user = User.get_user(token)
    	if gig != nil
			neighborhoods_id = neighborhoods_by_gig(gig.id)
			@gig = {}
			@user = gig.user
			@gig[:id] = gig.id
			@gig[:title] = gig.title
			@gig[:description] = gig.description
			@gig[:price] = gig.price
			@gig[:user_id] = gig.user_id
			@gig[:is_active] = gig.is_active
			@gig[:is_featured] = gig.featured
			@gig[:token] = gig.token
			@gig[:status] = gig.status.to_i
			@gig[:name] = @user.first_name+' '+@user.last_name
			@gig[:bio] = @user.bio
			@gig[:image] = @user.photo_url
			@gig[:likes] = GigLike.like_count(gig.id)
			@gig[:is_liked] = GigLike.user_like(gig.id,user.id).to_s
			neighborhood_name = []
			neighborhoods_id.each do |gig_neighborhood|
				neighborhood = Neighborhood.find(gig_neighborhood)
				if neighborhood.entire_city == true
					name = City.find(neighborhood.city_id).name
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT 1
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1

    def self.gig_info(gig,token)
    	user = User.get_user(token)
    	if gig != nil
			neighborhoods_id = neighborhoods_by_gig(gig.id)
			@gig = {}
			@user = gig.user
			@gig[:id] = gig.id
			@gig[:title] = gig.title
			@gig[:description] = gig.description
			@gig[:price] = gig.price
			@gig[:user_id] = gig.user_id
			@gig[:is_active] = gig.is_active
			@gig[:is_featured] = gig.featured
			@gig[:token] = gig.token
			@gig[:status] = gig.status.to_i
			@gig[:name] = @user.first_name+' '+@user.last_name
			@gig[:bio] = @user.bio
			@gig[:image] = @user.photo_url
			@gig[:likes] = GigLike.like_count(gig.id)
			@gig[:is_liked] = GigLike.user_like(gig.id,user.id).to_s
			neighborhood_name = []
			neighborhoods_id.each do |gig_neighborhood|
				neighborhood = Neighborhood.find(gig_neighborhood)
---
SELECT  "neighborhoods".* FROM "neighborhoods" WHERE "neighborhoods"."id" = $1 LIMIT 1

    def self.is_unseen_request(user_id)
			request = Request.find_by("seller_id = ? AND seen = ?",user_id,0)
---
SELECT  "requests".* FROM "requests" WHERE (seller_id = 1 AND seen = 0) LIMIT 1

    def self.pending_review(user_id)
    	request_ids = buyer_requests(user_id)
    	reviews_request_ids = Review.where(user_id: user_id).pluck(:request_id)
---
SELECT "reviews"."request_id" FROM "reviews" WHERE "reviews"."user_id" = $1

    def self.buyer_requests(user_id)
    	Request.where(buyer_id: user_id,status: 7).pluck(:id)
---
SELECT "requests"."id" FROM "requests" WHERE "requests"."buyer_id" = $1 AND "requests"."status" = $2

    def self.neighborhoods_by_gig(id)
		GigNeighborhoodAssociation.where(:gig_id => id).pluck(:neighborhood_id)
---
SELECT "gig_neighborhood_associations"."neighborhood_id" FROM "gig_neighborhood_associations" WHERE "gig_neighborhood_associations"."gig_id" = $1

	def self.gig_likes(gig_id)
		GigLike.where(:gig_id => gig_id).pluck(:user_id)
---
SELECT "gig_likes"."user_id" FROM "gig_likes" WHERE "gig_likes"."gig_id" = $1

	def self.gig_category(id)
		Category.find(id).name
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1

	def self.gig_by_neighborhood(neighborhood_id,category_id)
		if GigNeighborhoodAssociation.exists?(:neighborhood_id => neighborhood_id)
			gig_ids = []
			GigNeighborhoodAssociation.where(:neighborhood_id => neighborhood_id).order('updated_at desc').each do |association|
				if category_id != nil && category_id.length != 0
					gig = Gig.find(association.gig_id)
---
SELECT  1 AS one FROM "gig_neighborhood_associations" WHERE "gig_neighborhood_associations"."neighborhood_id" = $1 LIMIT 1
SELECT "gig_neighborhood_associations".* FROM "gig_neighborhood_associations" WHERE "gig_neighborhood_associations"."neighborhood_id" = $1  ORDER BY updated_at desc
SELECT  "gigs".* FROM "gigs" WHERE "gigs"."id" = $1 LIMIT 1

	def self.gig_reviews(requests)
		@reviews = []
		requests.each do |request|
			reviews = request.reviews
			reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."request_id" = $1

	def self.average_review(requests)
		@reviews = []
		requests.each do |request|
			reviews = request.reviews
			@reviews.push(reviews.pluck(:rating)).flatten!
---
SELECT "reviews"."rating" FROM "reviews" WHERE "reviews"."request_id" = $1

	def self.total_review(requests)
		count = 0
		requests.each do |request|
			if Review.exists?(request_id: request.id)
---
SELECT  1 AS one FROM "reviews" WHERE "reviews"."request_id" = $1 LIMIT 1

	def self.is_card_available(user_id)
		BuyerAccount.exists?(user_id: user_id)
---
SELECT  1 AS one FROM "buyer_accounts" WHERE "buyer_accounts"."user_id" = $1 LIMIT 1

	def self.search(params,token)
		featured = params[:featured]
		query = params[:query]
		page = params[:page]
		if params.has_key?(:lat) && params.has_key?(:lng) && params.has_key?(:city) && params.has_key?(:hood)
			gigs = []
			neighborhood_ids = params[:hood]
			if neighborhood_ids != nil
			  @neighborhood_ids = City.sort_neighborhood(params[:lat],params[:lng],neighborhood_ids)
			  @neighborhood_ids = neighborhood_ids.split(',')
			  if @neighborhood_ids != nil && @neighborhood_ids.length != 0
			    @neighborhood_ids.each do |neighborhood_id|
			  	  gig_id = gig_by_neighborhood(neighborhood_id,params[:category_id])
		      	if gig_id != nil
	          	gigs.push(gig_id)
		        end
		      end
        end
      	@gigs = Paging.pagination(gigs,page)
        if page != nil
        	if @gigs != nil
        		gig_data(@gigs.flatten.uniq,token,featured,query)
          end
        else
        	gig_data(gigs.flatten.uniq,token,featured,query)
        end
			end
		elsif params.has_key?(:lat) && params.has_key?(:lng) && params.has_key?(:city)
	        gigs = []
	        city = City.find(params[:city])
	    neighborhood_ids = city.neighborhoods.pluck(:id)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1
SELECT "neighborhoods"."id" FROM "neighborhoods" WHERE "neighborhoods"."city_id" = $1

	def self.check_bookmarked(user_id,gig_id)
		Bookmark.exists?(user_id: user_id, gig_id: gig_id)
---
SELECT  1 AS one FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."gig_id" = $2 LIMIT 1