app/models/gig_like.rb

	def self.like_count(gig_id)
		GigLike.where(:gig_id => gig_id).length
---
SELECT "gig_likes".* FROM "gig_likes" WHERE "gig_likes"."gig_id" = $1

	def self.user_like(gig_id,user_id)
		GigLike.exists?(:gig_id => gig_id,:user_id => user_id)
---
SELECT  1 AS one FROM "gig_likes" WHERE "gig_likes"."gig_id" = $1 AND "gig_likes"."user_id" = $2 LIMIT 1