app/models/user.rb

  def self.get_user(token)
    User.find_by(:token => token)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."token" = $1 LIMIT 1

  def self.is_facebook_verified(user_id)
    user = User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = $1 LIMIT 1

  def self.referral_code(user_id)
    ReferralCode.find_by(user_id: user_id).code
---
SELECT  "referral_codes".* FROM "referral_codes" WHERE "referral_codes"."user_id" = $1 LIMIT 1

  def genrate_referral_code
    number = Random.new.rand(10..99)
    code = self.first_name.upcase+number.to_s
    if !ReferralCode.exists?(user_id: self.id)
      ReferralCode.create!(code: code,user_id: self.id)
---
SELECT  1 AS one FROM "referral_codes" WHERE "referral_codes"."user_id" = $1 LIMIT 1
INSERT INTO "referral_codes" ("code", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"